Robothaler/ESP32-PoolMaster/sdkconfig.defaults
# sdkconfig.defaults for ESP32-PoolMaster (ESP32-S3, Matter over Wi-Fi)
# Used only by matter_serial / matter_ota environments (framework = espidf, arduino).
# Regular arduino-only environments (serial_upload, OTA_upload) ignore this file.

# ── Target ─────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ──────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (8MB OPI/Octal) ──────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Route malloc()>=512B to PSRAM instead of internal RAM (default threshold was 16384).
# This prevents heap fragmentation in the 181KB internal region caused by hundreds of
# medium-sized allocations (WiFi task stack 6.6KB, Matter endpoint objects ~1-2KB each,
# NimBLE host buffers, lwIP etc.). BLE controller still gets its contiguous block because
# it uses heap_caps_malloc(MALLOC_CAP_INTERNAL) explicitly and is not affected by this.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512

# ── ESP32-S3 Instruction Cache / IRAM balance ──────────────────────────────────
# S3 Bank 0 = 48KB split between I-Cache and IRAM:
#   32KB cache → 16KB IRAM  (default, leads to 100% IRAM usage with Matter)
#   16KB cache →  32KB IRAM  ← use this; SPIRAM_FETCH_INSTRUCTIONS compensates the smaller cache
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y

# ── Power / Brownout ──────────────────────────────────────────────────────────
CONFIG_ESP_BROWNOUT_DET=y

# ── Console / Serial ───────────────────────────────────────────────────────────
# Use UART0 instead of USB-JTAG as system console.
# Fixes crash: Brownout-ISR calls HWCDC::isConnected() → usb_serial_jtag_is_connected()
# before the USB connection monitor is initialized (null-pointer at 0x00000000).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n

# ── Arduino compatibility ───────────────────────────────────────────────────────
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_ARDUINO_SELECTIVE_COMPILATION=y
# Disable Arduino libraries not needed by PoolMaster
# Bluetooth / radio stacks
CONFIG_ARDUINO_SELECTIVE_BLE=n
CONFIG_ARDUINO_SELECTIVE_BluetoothSerial=n
CONFIG_ARDUINO_SELECTIVE_SimpleBLE=n
CONFIG_ARDUINO_SELECTIVE_WiFiProv=n
CONFIG_ARDUINO_SELECTIVE_OpenThread=n
CONFIG_ARDUINO_SELECTIVE_Zigbee=n
# Cloud / insights
CONFIG_ARDUINO_SELECTIVE_RainMaker=n
CONFIG_ARDUINO_SELECTIVE_Insights=n
# Audio / speech
CONFIG_ARDUINO_SELECTIVE_ESP_SR=n
# HTTP (project uses AsyncMqttClient + ESPAsyncWebServer, not HTTPClient)
CONFIG_ARDUINO_SELECTIVE_HTTPClient=n
CONFIG_ARDUINO_SELECTIVE_HTTPUpdate=n
# Storage (project uses SPIFFS, not SD / FFat / LittleFS / EEPROM)
CONFIG_ARDUINO_SELECTIVE_EEPROM=n
CONFIG_ARDUINO_SELECTIVE_SD=n
CONFIG_ARDUINO_SELECTIVE_SD_MMC=n
CONFIG_ARDUINO_SELECTIVE_FFat=n
CONFIG_ARDUINO_SELECTIVE_LittleFS=n
# Networking extras not used
CONFIG_ARDUINO_SELECTIVE_Ethernet=n
CONFIG_ARDUINO_SELECTIVE_PPP=n
CONFIG_ARDUINO_SELECTIVE_AsyncUDP=n
CONFIG_ARDUINO_SELECTIVE_DNSServer=n
CONFIG_ARDUINO_SELECTIVE_NetBIOS=n
CONFIG_ARDUINO_SELECTIVE_WebServer=n

# ── FreeRTOS ───────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── Bluetooth (NimBLE for Matter commissioning) ────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=n
# BLE advertising used by Matter for commissioning; disable after commissioned if desired
CONFIG_ENABLE_CHIPOBLE=y

# ── BLE / BT controller memory reduction (prevents OOM crash on boot) ──────────
# BT controller TLSF heap ≈ 50KB base + 10KB × MAX_ACT.
# Default MAX_ACT=6 → ~110KB heap. After WiFi init the largest free internal block
# shrinks below that threshold → assert in block_locate_free → reboot loop.
# MAX_ACT=2 (1 adv + 1 connection) → ~70KB heap — comfortably fits.
CONFIG_BT_CTRL_BLE_MAX_ACT=2
# Reduce scan ADV-report and duplicate-filter caches (not needed for commissioning)
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=20
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=20

# NimBLE host buffers: use default (PSRAM-capable) allocator instead of INTERNAL.
# With SPIRAM_USE_MALLOC=y this moves ~20KB of NimBLE ACL/event buffers to PSRAM,
# freeing contiguous internal RAM for the BT controller heap.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_DEFAULT=y

# Reduce NimBLE max connections to 1: only 1 BLE link needed for commissioning
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# ── OpenThread — disabled (Wi-Fi only, no Thread border router) ────────────────
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_OPENTHREAD_RADIO_NATIVE=n

# ── Wi-Fi ──────────────────────────────────────────────────────────────────────
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP32_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP32_WIFI_NAN_ENABLE=n
# Static RX buffers must be DMA-capable internal RAM. 10×1600=16KB (default);
# 4×1600=6.4KB is the minimum. Saves ~9.6KB of contiguous DMA-capable RAM.
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=4

# ── Matter / CHIP stack ────────────────────────────────────────────────────────
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y

# Matter Bridge + native Solar endpoints:
#   Bridged:  Aggregator + 5 pumps = 6
#   Native:   Pool-Temp + Pool-Soll + Solar-Mode-Request = 3
#   Total:    9 → use 12 for comfortable headroom
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=12

# Matter Controller: required for PoolMaster to send commands to SolarControl
# and subscribe to SolarControl attribute reports.
CONFIG_ESP_MATTER_CONTROLLER_ENABLE=y

# ── NVS ───────────────────────────────────────────────────────────────────────
# NVS partition (64 KB) shared between PoolMaster config (~16 KB) and Matter (~32 KB)
CONFIG_NVS_ENCRYPTION=n

# ── Stack / heap tuning ────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_CHIP_TASK_STACK_SIZE=8192
# Bump CHIP main task priority so BLE/CHIPoBLE handshake is processed
# promptly even when sensor/UI tasks are busy.  Apple Home was timing out
# during PASE because the chip task (priority 1) was being preempted by
# the high‑rate I²C/sensor loops.  Priority 7 sits above MQTT/AsyncTCP (5)
# but below FreeRTOS timer task (1 below configMAX_PRIORITIES).
CONFIG_CHIP_TASK_PRIORITY=7

# ── Logging ───────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# ── mbedTLS / heap ────────────────────────────────────────────────────────────
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# HKDF required by Matter's CHIP crypto (CHIPCryptoPALmbedTLS.cpp calls mbedtls_hkdf)
CONFIG_MBEDTLS_HKDF_C=y

# ── Compiler ──────────────────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
